cf/Catalogs/обм_ОбменДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>обм_ОбменДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумОбъектовВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьВБуфере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствияПутей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьТут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьТам</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/обм_Кэш/Ext/Module.bsl
Функция ПолучитьСоединение(ОбменДанными) Экспорт
	
	Перем Соединение;
	
	Попытка
		Выполнить(ОбменДанными.АлгоритмИнициализацииСоединения);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

Функция КлючСоединенияВКеше() Экспорт
	
	Возврат "Соединение";
	
КонецФункции

Функция ПолучитьМетаСписок() Экспорт
	
	Список = Новый СписокЗначений;
	
	// Получим метаданные
	
	Для КАждого Справочник Из Метаданные.Справочники Цикл Список.Добавить(Справочник.ПолноеИмя(), обм_Обмен.ПолучитьПредставлениеМетаДанного(Справочник.ПолноеИмя(), Справочник.Синоним)) КонецЦикла;
	Для КАждого Документ Из Метаданные.Документы Цикл Список.Добавить(Документ.ПолноеИмя(), обм_Обмен.ПолучитьПредставлениеМетаДанного(Документ.ПолноеИмя(), Документ.Синоним)) КонецЦикла;
	Для КАждого Перечисление Из Метаданные.Перечисления Цикл Список.Добавить(Перечисление.ПолноеИмя(), обм_Обмен.ПолучитьПредставлениеМетаДанного(Перечисление.ПолноеИмя(), Перечисление.Синоним)) КонецЦикла;
	
	Список.СортироватьПоПредставлению();
	
	Возврат Список;
	
КонецФункции
Функция ПолучитьМетаСписокДругой(Обмен) Экспорт
	
	Список 		= Новый СписокЗначений;
	Connect 	= обм_Обмен.ПолучитьHTTPСоединение(Обмен);
	HTTPRequest	= обм_Обмен.ПолучитьHTTPЗапрос_Метаданные(Обмен);
	
	Попытка		HTTPResponse = Connect.GET(HTTPRequest);
	Исключение	
				стрОшибки = ОписаниеОшибки();
				Сообщить("Ошибка инициализации соединения: " + стрОшибки); 
				Возврат Неопределено; КонецПопытки;
			
	СтрокаВозврата = HTTPResponse.GetBodyAsString();
	
	Если HTTPResponse.StatusCode <> 200 Тогда
		Сообщить("Ошибка в другой базе (" + HTTPResponse.StatusCode + "): " + СтрокаВозврата);
		Возврат Неопределено; КонецЕсли;
	
	стрОшибки = "";
	НастройкиДругие = обм_Обмен.ПреобразоватьИзJSON(HTTPResponse.GetBodyAsString(), стрОшибки, Истина);
	Если стрОшибки <> "" Тогда
		Сообщить("Ошибка преобразования из JSON строки: " + стрОшибки); 
		Возврат Неопределено; КонецЕсли;
	
	Для Каждого Элемент Из НастройкиДругие["МетаДанные"]["Справочники"]["МетаДанные"] Цикл Список.Добавить(Элемент.Ключ, обм_Обмен.ПолучитьПредставлениеМетаДанного(Элемент.Ключ, Элемент.Значение["Синоним"])); КонецЦикла;
	Для Каждого Элемент Из НастройкиДругие["МетаДанные"]["Документы"]["МетаДанные"] Цикл Список.Добавить(Элемент.Ключ, обм_Обмен.ПолучитьПредставлениеМетаДанного(Элемент.Ключ, Элемент.Значение["Синоним"])); КонецЦикла;
	Для Каждого Элемент Из НастройкиДругие["МетаДанные"]["Перечисления"]["МетаДанные"] Цикл Список.Добавить(Элемент.Ключ, обм_Обмен.ПолучитьПредставлениеМетаДанного(Элемент.Ключ, Элемент.Значение["Синоним"])); КонецЦикла;
	
	Список.СортироватьПоПредставлению();
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьСоответствиеПутей(Обмен) Экспорт
	
	Соотв = Новый Соответствие;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПутьТут, ПутьТам ИЗ Справочник.обм_ОбменДанными.СоответствияПутей ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Обмен);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл Соотв.Вставить(Выборка.ПутьТут, Выборка.ПутьТам) КонецЦикла;
	
	Возврат Соотв;
	
КонецФункции
